Repository: tekmexico-franzmarz/chat-client-side
Catalog: src/locale/messages.*.xlf
Languages: es

# homeTitle
source: Welcome to my app.
es: Bienvenido a mi app.

# homeText
source: This is an Angular 4 application, with NodeJS in the backend and a Mongo DB database. Please click in the bottom below to continue.
es: Esta es una app hecha con Angular 4, NodeJS y Mongo DB. Haz click en el boton debajo para continuar.

# homeButton
source: Log In/Sign Up
es: Acceder/Registrarse

# loginTitle
source: Log In
es: Acceder

source: Email Address
es: Dirección Email

source: Password
es: Contraseña

# btnForgotPass
source: Forgot Password?
es: Olvidó su Contraseña?

# btnsignUp
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Sign Up
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Registrarse

# btnLogIn
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Log In
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Acceder

# titleLoginModal
source: Forgotten Password
es: Recuperación de Contraseña

# bodyLoginModal
source: Send an email to {START_LINK}fmartinez@tekmexico.com{CLOSE_LINK} to ask for a password reset.
es: Envíe un email a {START_LINK}fmartinez@tekmexico.com{CLOSE_LINK} y solicite el restablecimiento de su contraseña.

# btnCloseLoginModal
source: Close
es: Cerrar

# signupTitle
source: Register New User
es: Registro de Nuevo Usuario

source: Your Full Name
es: Nombre Completo

source: Your Email Address
es: Dirección Email

source: Your Password
es: Contraseña

source: Confirm Password
es: Confirme su Contraseña

# btnBackSignup
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Go Back
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Regresar

# btnRegisterSignup
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Register
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Registrar

# headerComingSoon
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Coming Soon
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Próximamente

# footerComingSoon
source: Coming Soon
es: Próximamente

# breadContacts
source: Contacts
es: Contactos

# breadListContacts
source: List All Contacts
es: Ver Todos los Contacts

# breadMainNav
source: My Dashboard
es: Mi Dashboard

# messagesCard
source: 26 New Messages!
es: 26 Nuevos Mensajes!

source: View Details
es: Ver Detalles

# requestsCard
source: 1 Friend Request!
es: 1 Solicitud de Amistad!

# groupChatCard
source: Start a Group Chat
es: Iniciar Chat Grupal

# logoutCard
source: Log Out
es: Salir

# logoutCardFooter
source: Click Here to Log Out
es: Haga Click Aqui para Salir

# welcomeSpanMainNav
source: Welcome
es: Bienvenido

# contactsMenuMainNav
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Contacts
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Contactos

# manageContactsMenuMainNav
source: Add/Remove Contacts
es: Agregar/Quitar Contactos

# filterContactsMenuMainNav
source: Filter By:
es: Filtrar Por:

# onlineContactsMenuMainNav
source: Online Now
es: En Línea Ahora

# relContactsMenuMainNav
source: Relationship
es: Relación

# newGroupMainNav
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} New Group Chat
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Nuevo Chat Grupal

# myProfileMainNav
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} My Profile
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Mi Perfíl

# settingsMainNav
source: Settings
es: Ajustes

# logoutFromMainNav
source: Logout
es: Salir

# viewHeaderMainNav
source: View...
es: Ver...

# viewYourContactListMainNav
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Your Contact List
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Su Lista de Contactos

# viewYourConversationListMainNav
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Your Conversations
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Sus Conversaciones

# breadContactsManageContacts
source: Contacts
es: Contactos

# breadAddRemoveManageContacts
source: Add/Remove Contacts
es: Agregar/Quitar Contactos

# titleAddContactManageContacts
source: Add New Contact
es: Agregar Nuevo Contacto

# searchFieldManageContacts
source: Search by E-Mail Address
es: Buscar por dirección E-Mail

# btnSubmitManageContacts
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Send Request
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Enviar Petición

# headerNotificationsCard
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Your Notifications
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Sus Notificaciones

# breadcrumbMyProfileSettings
source: My Profile
es: Mi Perfil

# breadcrumbSettings
source: Settings
es: Ajustes

# titleSettings
source: Your Profile Settings
es: Ajustes del Perfil

# labelUsernameSettings
source: Username
es: Nombre de Usuario

source: New Username
es: Nuevo Nombre de Usuario

# labelPasswordSettings
source: Change Password
es: Cambiar Contraseña

# labelConfirmPasswordSettings
source: Confirm New Password
es: Confirmar Contraseña

# labelChangeLangSettings
source: Change Language
es: Cambiar Lenguaje

# btnChangeLangSettings
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Languages
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Lenguajes

# btnUpdateSettings
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Update
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Actualizar

# titleModalSettings
source: Select Language
es: Seleccionar Lenguaje

# subTitleModalSettings
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Available Languages
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Lenguajes Disponibles

# btnCancelModalSettings
source: Cancel
es: Cancelar

# btnDoneModalSettings
source: Done
es: Terminar

# breadCreateGroupChat
source: Create Group Chat
es: Crear Chat Grupal

# titleCreateGroupChat
source: Create Group Chat
es: Crear Chat Grupal

# labelCreateGroupChat
source: Group Chat Name
es: Nombre de Chat Grupal

source: Group Name
es: Nombre del Grupo

# labelAddParticipantsCreateGroupChat
source: Add Participants
es: Agregar Participantes

# btnAddCreateGroupChat
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Add
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Agregar

# labelSelectedParticipantsCreateGroupChat
source: Selected Participants
es: Participantes Seleccionados

# btnCreateCreateGroupChat
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Create
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Crear

# titleModalCreateGroupChat
source: Select Participants
es: Participantes Seleccionados

# subTitleModalCreateGroupChat
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Your Contacts
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Sus Contactos

# btnCancelModalCreateGroupChat
source: Cancel
es: Cancelar

# btnDoneModalCreateGroupChat
source: Done
es: Terminar

# titleChatWindowChatView
source: Chat Window
es: Ventana de Chat

# btnAddParticipantChatView
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Add Participant
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Agregar Participante

# participantsListChatView
source: Participants: {START_TAG_SPAN} {START_LINK}{INTERPOLATION}{CLOSE_LINK} {CLOSE_TAG_SPAN}
es: Participantes: {START_TAG_SPAN} {START_LINK}{INTERPOLATION}{CLOSE_LINK} {CLOSE_TAG_SPAN}

source: Type your message here...
es: Escriba su mensaje...

# btnSendChatView
source: Send
es: Enviar

# btnCanvasChatView
source: Draw
es: Dibujar

# modalTitleChatView
source: Add Participants
es: Agregar Participantes

# modalSubTitleChatView
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Your Contacts
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Sus Contactos

# btnCancelModalChatView
source: Cancel
es: Cancelar

# btnDoneModalChatView
source: Done
es: Terminar

# canvasTitleChatView
source: Send a drawing
es: Envía un dibujo

# canvasSubTitleChatView
source: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Use your mouse to draw on the canvas
es: {START_ITALIC_TEXT}{CLOSE_ITALIC_TEXT} Usa el mouse para dibujar en el canvas
